; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=5, packages=11, locations=12, density=0.24242424242424243, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=23, seed=64

(define (problem transport-23)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l12)
    (at p3 l11)
    (at p4 l4)
    (at p5 l12)
    (at p6 l11)
    (at p7 l3)
    (at p8 l2)
    (at p9 l7)
    (at p10 l8)
    (at p11 l4)
    (at v1 l12)
    (at v2 l1)
    (at v3 l2)
    (at v4 l7)
    (at v5 l11)
    (road l5 l9)
    (road l4 l7)
    (road l10 l11)
    (road l7 l12)
    (road l9 l8)
    (road l10 l6)
    (road l3 l11)
    (road l8 l9)
    (road l11 l10)
    (road l2 l9)
    (road l6 l10)
    (road l1 l10)
    (road l8 l6)
    (road l6 l4)
    (road l12 l7)
    (road l10 l1)
    (road l6 l8)
    (road l4 l6)
    (road l9 l2)
    (road l11 l3)
    (road l7 l4)
    (road l9 l5)
    (road l5 l10)
    (road l10 l5)
    (road l2 l5)
    (road l5 l2)
    (road l6 l12)
    (road l12 l6)
    (road l5 l8)
    (road l8 l5)
    (road l3 l8)
    (road l8 l3)
    )
 (:goal  (and 
    (at p1 l6)
    (at p2 l9)
    (at p3 l12)
    (at p4 l1)
    (at p5 l1)
    (at p6 l12)
    (at p7 l12)
    (at p8 l9)
    (at p9 l6)
    (at p10 l11)
    (at p11 l3))))

; plan
1. (drive v5 l11 l10)
   deleted: (at v5 l11)
   added: (at v5 l10)
   goals met: 0 of 11
2. (pick-up v4 l7 p9 c0 c1)
   deleted: (at p9 l7) (capacity v4 c1)
   added: (in p9 v4) (capacity v4 c0)
   goals met: 0 of 11
3. (drive v4 l7 l4)
   deleted: (at v4 l7)
   added: (at v4 l4)
   goals met: 0 of 11
4. (drive v4 l4 l6)
   deleted: (at v4 l4)
   added: (at v4 l6)
   goals met: 0 of 11
5. (pick-up v3 l2 p8 c1 c2)
   deleted: (at p8 l2) (capacity v3 c2)
   added: (in p8 v3) (capacity v3 c1)
   goals met: 0 of 11
6. (drive v5 l10 l6)
   deleted: (at v5 l10)
   added: (at v5 l6)
   goals met: 0 of 11
7. (drive v3 l2 l9)
   deleted: (at v3 l2)
   added: (at v3 l9)
   goals met: 0 of 11
8. (drop v3 l9 p8 c1 c2)
   deleted: (in p8 v3) (capacity v3 c1)
   added: (at p8 l9) (capacity v3 c2)
   goals met: 1 of 11
9. (drop v4 l6 p9 c0 c1)
   deleted: (in p9 v4) (capacity v4 c0)
   added: (at p9 l6) (capacity v4 c1)
   goals met: 2 of 11
10. (drive v5 l6 l10)
   deleted: (at v5 l6)
   added: (at v5 l10)
   goals met: 2 of 11
11. (drive v5 l10 l5)
   deleted: (at v5 l10)
   added: (at v5 l5)
   goals met: 2 of 11
12. (pick-up v5 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v5 c1)
   added: (in p1 v5) (capacity v5 c0)
   goals met: 2 of 11
13. (drive v5 l5 l8)
   deleted: (at v5 l5)
   added: (at v5 l8)
   goals met: 2 of 11
14. (drive v5 l8 l6)
   deleted: (at v5 l8)
   added: (at v5 l6)
   goals met: 2 of 11
15. (drop v5 l6 p1 c0 c1)
   deleted: (in p1 v5) (capacity v5 c0)
   added: (at p1 l6) (capacity v5 c1)
   goals met: 3 of 11
16. (drive v5 l6 l12)
   deleted: (at v5 l6)
   added: (at v5 l12)
   goals met: 3 of 11
17. (drive v4 l6 l10)
   deleted: (at v4 l6)
   added: (at v4 l10)
   goals met: 3 of 11
18. (pick-up v5 l12 p2 c0 c1)
   deleted: (at p2 l12) (capacity v5 c1)
   added: (in p2 v5) (capacity v5 c0)
   goals met: 3 of 11
19. (drive v5 l12 l6)
   deleted: (at v5 l12)
   added: (at v5 l6)
   goals met: 3 of 11
20. (drive v4 l10 l6)
   deleted: (at v4 l10)
   added: (at v4 l6)
   goals met: 3 of 11
21. (drive v5 l6 l8)
   deleted: (at v5 l6)
   added: (at v5 l8)
   goals met: 3 of 11
22. (drive v5 l8 l9)
   deleted: (at v5 l8)
   added: (at v5 l9)
   goals met: 3 of 11
23. (drop v5 l9 p2 c0 c1)
   deleted: (in p2 v5) (capacity v5 c0)
   added: (at p2 l9) (capacity v5 c1)
   goals met: 4 of 11
24. (drive v4 l6 l12)
   deleted: (at v4 l6)
   added: (at v4 l12)
   goals met: 4 of 11
25. (pick-up v4 l12 p5 c0 c1)
   deleted: (at p5 l12) (capacity v4 c1)
   added: (in p5 v4) (capacity v4 c0)
   goals met: 4 of 11
26. (drive v2 l1 l10)
   deleted: (at v2 l1)
   added: (at v2 l10)
   goals met: 4 of 11
27. (drive v4 l12 l6)
   deleted: (at v4 l12)
   added: (at v4 l6)
   goals met: 4 of 11
28. (drive v4 l6 l10)
   deleted: (at v4 l6)
   added: (at v4 l10)
   goals met: 4 of 11
29. (drive v4 l10 l1)
   deleted: (at v4 l10)
   added: (at v4 l1)
   goals met: 4 of 11
30. (drop v4 l1 p5 c0 c1)
   deleted: (in p5 v4) (capacity v4 c0)
   added: (at p5 l1) (capacity v4 c1)
   goals met: 5 of 11
31. (drive v2 l10 l6)
   deleted: (at v2 l10)
   added: (at v2 l6)
   goals met: 5 of 11
32. (drive v2 l6 l4)
   deleted: (at v2 l6)
   added: (at v2 l4)
   goals met: 5 of 11
33. (drive v5 l9 l8)
   deleted: (at v5 l9)
   added: (at v5 l8)
   goals met: 5 of 11
34. (pick-up v2 l4 p4 c0 c1)
   deleted: (at p4 l4) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 5 of 11
35. (drive v2 l4 l6)
   deleted: (at v2 l4)
   added: (at v2 l6)
   goals met: 5 of 11
36. (drive v2 l6 l10)
   deleted: (at v2 l6)
   added: (at v2 l10)
   goals met: 5 of 11
37. (drive v2 l10 l1)
   deleted: (at v2 l10)
   added: (at v2 l1)
   goals met: 5 of 11
38. (drop v2 l1 p4 c0 c1)
   deleted: (in p4 v2) (capacity v2 c0)
   added: (at p4 l1) (capacity v2 c1)
   goals met: 6 of 11
39. (pick-up v5 l8 p10 c0 c1)
   deleted: (at p10 l8) (capacity v5 c1)
   added: (in p10 v5) (capacity v5 c0)
   goals met: 6 of 11
40. (drive v5 l8 l3)
   deleted: (at v5 l8)
   added: (at v5 l3)
   goals met: 6 of 11
41. (drive v5 l3 l11)
   deleted: (at v5 l3)
   added: (at v5 l11)
   goals met: 6 of 11
42. (drop v5 l11 p10 c0 c1)
   deleted: (in p10 v5) (capacity v5 c0)
   added: (at p10 l11) (capacity v5 c1)
   goals met: 7 of 11
43. (pick-up v5 l11 p3 c0 c1)
   deleted: (at p3 l11) (capacity v5 c1)
   added: (in p3 v5) (capacity v5 c0)
   goals met: 7 of 11
44. (drive v5 l11 l10)
   deleted: (at v5 l11)
   added: (at v5 l10)
   goals met: 7 of 11
45. (drive v5 l10 l6)
   deleted: (at v5 l10)
   added: (at v5 l6)
   goals met: 7 of 11
46. (drive v5 l6 l12)
   deleted: (at v5 l6)
   added: (at v5 l12)
   goals met: 7 of 11
47. (drop v5 l12 p3 c0 c1)
   deleted: (in p3 v5) (capacity v5 c0)
   added: (at p3 l12) (capacity v5 c1)
   goals met: 8 of 11
48. (drive v5 l12 l6)
   deleted: (at v5 l12)
   added: (at v5 l6)
   goals met: 8 of 11
49. (drive v5 l6 l10)
   deleted: (at v5 l6)
   added: (at v5 l10)
   goals met: 8 of 11
50. (drive v5 l10 l11)
   deleted: (at v5 l10)
   added: (at v5 l11)
   goals met: 8 of 11
51. (pick-up v5 l11 p6 c0 c1)
   deleted: (at p6 l11) (capacity v5 c1)
   added: (in p6 v5) (capacity v5 c0)
   goals met: 8 of 11
52. (drive v5 l11 l3)
   deleted: (at v5 l11)
   added: (at v5 l3)
   goals met: 8 of 11
53. (drive v5 l3 l8)
   deleted: (at v5 l3)
   added: (at v5 l8)
   goals met: 8 of 11
54. (drive v5 l8 l6)
   deleted: (at v5 l8)
   added: (at v5 l6)
   goals met: 8 of 11
55. (drive v5 l6 l12)
   deleted: (at v5 l6)
   added: (at v5 l12)
   goals met: 8 of 11
56. (drop v5 l12 p6 c0 c1)
   deleted: (in p6 v5) (capacity v5 c0)
   added: (at p6 l12) (capacity v5 c1)
   goals met: 9 of 11
57. (drive v5 l12 l6)
   deleted: (at v5 l12)
   added: (at v5 l6)
   goals met: 9 of 11
58. (drive v5 l6 l8)
   deleted: (at v5 l6)
   added: (at v5 l8)
   goals met: 9 of 11
59. (drive v5 l8 l3)
   deleted: (at v5 l8)
   added: (at v5 l3)
   goals met: 9 of 11
60. (pick-up v5 l3 p7 c0 c1)
   deleted: (at p7 l3) (capacity v5 c1)
   added: (in p7 v5) (capacity v5 c0)
   goals met: 9 of 11
61. (drive v5 l3 l8)
   deleted: (at v5 l3)
   added: (at v5 l8)
   goals met: 9 of 11
62. (drive v5 l8 l6)
   deleted: (at v5 l8)
   added: (at v5 l6)
   goals met: 9 of 11
63. (drive v5 l6 l12)
   deleted: (at v5 l6)
   added: (at v5 l12)
   goals met: 9 of 11
64. (drop v5 l12 p7 c0 c1)
   deleted: (in p7 v5) (capacity v5 c0)
   added: (at p7 l12) (capacity v5 c1)
   goals met: 10 of 11
65. (drive v5 l12 l6)
   deleted: (at v5 l12)
   added: (at v5 l6)
   goals met: 10 of 11
66. (drive v5 l6 l4)
   deleted: (at v5 l6)
   added: (at v5 l4)
   goals met: 10 of 11
67. (pick-up v5 l4 p11 c0 c1)
   deleted: (at p11 l4) (capacity v5 c1)
   added: (in p11 v5) (capacity v5 c0)
   goals met: 10 of 11
68. (drive v5 l4 l6)
   deleted: (at v5 l4)
   added: (at v5 l6)
   goals met: 10 of 11
69. (drive v5 l6 l8)
   deleted: (at v5 l6)
   added: (at v5 l8)
   goals met: 10 of 11
70. (drive v5 l8 l3)
   deleted: (at v5 l8)
   added: (at v5 l3)
   goals met: 10 of 11
71. (drop v5 l3 p11 c0 c1)
   deleted: (in p11 v5) (capacity v5 c0)
   added: (at p11 l3) (capacity v5 c1)
   goals met: 11 of 11
